INSERT INTO quiz (id, title, description, start_date, end_date, published) VALUES
(1,'最愛手搖飲','截至2024年...品牌。','2025-05-01','2025-05-20',1),
(2,'滑雪人調查問卷','新冠疫情後...市場開發。','2025-05-24','2025-06-30',1),
(3,'喜愛的戶外運動','感謝您撥冗填寫本問卷...','2025-09-30','2025-11-26',0),
(4,'懷舊電腦遊戲','感謝您撥冗參與本次問卷...','2025-06-25','2025-08-03',1);

INSERT INTO question (quiz_id, ques_id, question, type, required, options) VALUES
(1,1,'喝手搖飲的頻率','Single',1,'["1~5杯/天","1~5杯/週","1~5杯/月","不一定"]'),
(1,2,'喜歡的品牌','Multi',1,'["珍煮丹","五十嵐","可不可","迷克夏","麻古","其他"]'),
(1,3,'推薦的品牌','Text',0,'[]'),
(1,4,'如何選擇品牌','Multi',0,'["價格","優惠組合","品項內容"]'),
(1,5,'認為手搖飲是台灣名產嗎','Single',1,'["當然是","才不是"]');

INSERT INTO feedback (user_name, phone, email, age, quiz_id, ques_id, answer, fillin_date) VALUES
('菜一零','0912345678','10tsai@hotmail.com',28,1,1,'["1~5杯/週"]','2025-05-20'),
('菜一零','0912345678','10tsai@hotmail.com',28,1,2,'["五十嵐","迷克夏","麻古"]','2025-05-20'),
('菜一零','0912345678','10tsai@hotmail.com',28,1,3,'["八曜和茶"]','2025-05-20'),
('菜一零','0912345678','10tsai@hotmail.com',28,1,4,'["品項內容"]','2025-05-20'),
('菜一零','0912345678','10tsai@hotmail.com',28,1,5,'["當然是"]','2025-05-20'),
('陳奕遜','0978551425','chen@gmail.com',38,1,1,'["1~5杯/月"]','2025-05-05'),
('陳奕遜','0978551425','chen@gmail.com',38,1,2,'["珍煮丹","五十嵐","可不可","迷克夏"]','2025-05-05');
